#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`
#### Terraform Apply 📖`skipped`

<details><summary>Show Details</summary>

```terraform
data.terraform_remote_state.vpc: Reading...
module.kube.data.yandex_client_config.client: Reading...
module.kube.data.yandex_client_config.client: Read complete after 0s [id=1878154548]
data.terraform_remote_state.vpc: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.kube.random_string.unique_id will be created
  + resource "random_string" "unique_id" {
      + id          = (known after apply)
      + length      = 8
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.kube.time_sleep.wait_for_iam will be created
  + resource "time_sleep" "wait_for_iam" {
      + create_duration = "5s"
      + id              = (known after apply)
    }

  # module.kube.yandex_iam_service_account.master[0] will be created
  + resource "yandex_iam_service_account" "master" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + name       = (known after apply)
    }

  # module.kube.yandex_iam_service_account.node_account[0] will be created
  + resource "yandex_iam_service_account" "node_account" {
      + created_at = (known after apply)
      + folder_id  = "b1gsjjo950i2c5fs82pe"
      + id         = (known after apply)
      + name       = (known after apply)
    }

  # module.kube.yandex_kms_symmetric_key.kms_key[0] will be created
  + resource "yandex_kms_symmetric_key" "kms_key" {
      + created_at          = (known after apply)
      + default_algorithm   = "AES_256"
      + deletion_protection = false
      + description         = "K8S KMS symmetric key"
      + folder_id           = "b1gsjjo950i2c5fs82pe"
      + id                  = (known after apply)
      + name                = (known after apply)
      + rotated_at          = (known after apply)
      + rotation_period     = "8760h"
      + status              = (known after apply)
    }

  # module.kube.yandex_kms_symmetric_key_iam_binding.encrypter_decrypter[0] will be created
  + resource "yandex_kms_symmetric_key_iam_binding" "encrypter_decrypter" {
      + id               = (known after apply)
      + members          = (known after apply)
      + role             = "kms.keys.encrypterDecrypter"
      + symmetric_key_id = (known after apply)
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.node_account[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "node_account" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "container-registry.images.puller"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_calico_network_policy_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_calico_network_policy_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "k8s.clusters.agent"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_logging_writer_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_logging_writer_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "logging.writer"
    }

  # module.kube.yandex_resourcemanager_folder_iam_member.sa_public_loadbalancers_role[0] will be created
  + resource "yandex_resourcemanager_folder_iam_member" "sa_public_loadbalancers_role" {
      + folder_id = "b1gsjjo950i2c5fs82pe"
      + id        = (known after apply)
      + member    = (known after apply)
      + role      = "load-balancer.admin"
    }

Plan: 10 to add, 0 to change, 0 to destroy.
```

</details>

Results for commit: ce8e35435ce9e3ed1b39f00281e29f21049fae10

*Pusher: @ptishkin, Action: `pull_request`, Working Directory: `kube`, Workflow: `Terraform CI/CD`*